/*
1.	프로그램을 실행한다는 말은 CPU의 명령어 레지스터에 RIP에 프로그램 시작 명령어의 주소값을 전달한다고 하였다. 이때 C언어의
	main이 첫 번째 명령어의 주소값을 전달시키는 행위이다.
2.	수를 표현하는 방법을 기수법(Numeral system)이라고 한다. 우리는 십진법(decimal)을 이용하고 있다. 16진법의 경우 16진법임을 표시하기 위해 0x를 붙여 16792=0x418E로 표기한다. 
	16진법 2진화는 각 숫자를 이진법으로 변환하여 붙이면 되고, 역으로 2진법의 16진화는 각 숫자를 뒤에서 부터 4단위씩 끊어 읽어주면 된다.	
3.	휘발성 메모리(RAM, Random Access memory), 비휘발성 메모리(ROM, Read Only Memory, CD-ROM, DVD-ROM, Bios의 ROM, 하드디스크 등등)
	4비트를 니블(nibble)로 표기하기도 한다.
4.	CPU가 레지스터를 이용하여 연산이 실행되는 최소 단위를 워드라고 한다. 64비트의 경우 1워드가 64비트, 즉 8바이트이다. 
*/
